#include "Renderer.h"

using namespace std;

void Renderer::RenderingTitle()
{
	cout << "       /\\\\\\\\\\\\\\\\\\            /\\\\\\\\\\\\\\\\                /\\\\\\\\         /\\\\\\\\\\\\\\\\\\\\\\\\"					 << endl
		 << "      /\\\\\\///////\\\\\\        /\\\\\\\\/////\\\\\\\\           /\\\\\\\\\\\\       /\\\\\\\\\/\\\///////\\\\\\\\"					 << endl
		 << "      \\///      \\//\\\\\\     /\\\\\\\\     \\/\\\\\\\\         /\\\\\\\\/\\\\\\\\     \\/\\\\\\\\       \\/\\\\\\\\"				 << endl
		 << "                /\\\\\\\\/     \\/\\\\\\\\     \\/\\\\\\\\       /\\\\\\\\/\\/\\\\\\\\     \\////\\\\\\\\\\\\\\\\\\\\\\\\/"			 << endl
		 << "               /\\\\\\\\/       \\/\\\\\\\\     \\/\\\\\\\\     /\\\\\\\\/  \\/\\\\\\\\      /\\\\\\\\//////////\\\\\\\\"				 << endl
		 << "              /\\\\\\\\/         \\/\\\\\\\\     \\/\\\\\\\\   /\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\   /\\\\\\\\         \\//\\\\\\\\"   << endl
		 << "             /\\\\\\\\/           \\//\\\\\\\\    /\\\\\\\\   \\///////////\\\\\\\\//   \\//\\\\\\\\         /\\\\\\\\"				 << endl
		 << "            /\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\    \\///\\\\\\\\\\\\\\\\/              \\/\\\\\\\\       \\////\\\\\\\\\\\\\\\\\\\\\\\\\\/" << endl
		 << "            \\///////////////       \\////////                 \\////          \\/////////////"										 << endl;
}

void Renderer::RenderingFrame()
{
	cout << "旨收收收有收收收收收收收收收收收收收收收收收收收旬" << endl
	     << "早 2 早收收收收收收收收收收收收收收收收收收收收旬" << endl
	     << "曳收收收收收收收收收收收收收收收收收收收收收收收旬" << endl
	     << "旨收收收收收收收收收收收收收收收收收收收收收收收旬" << endl
	     << "旨收收收收收收收收收收收收收收收收收收收收收收收旬" << endl
	     << "旨收收收收收收收收收收收收收收收收收收收收收收收旬" << endl
	     << "旨收收收收收收收收收收收收收收收收收收收收收收收旬" << endl
	     << "旨收收收收收收收收收收收收收收收收收收收收收收收旬" << endl
	     << "旨收收收收收收收收收收收收收收收收收收收收收收收旬" << endl
	     << "旨收收收收收收收收收收收收收收收收收收收收收收收旬" << endl;


}